// 1.Пустий об'єкт;
const obj = {};
// 2. Створити пустий об’єкт без прототипу;
const emptyObj = Object.create(null);
// 3.Додати до об’єкта будь які нові поля всіма відомими способами;
obj.name = 'test';
obj['sex'] = 'man';
// 4.Створити пустий масив;
const arrTest = [];
// 5.Створити пустий масив довжиною 100500 елементів;
const emptyArr = new Array(100500);
// 6. Створити масив з декількома елементами;
let arr = [1, 2, 3];
// 7. Зробити заповнений масив пустим;
arr = [];
// 8.Дано масив, [1,2,3,4,5], потрібно створити функцію, яка видалить певний елемент з масиву за його індексом та
// поверне новий масив(оновлений- після видалення);
function deleteIndex(arr, index) {
    arr.splice(index, 1);
    return arr;
}

//console.log(deleteIndex([1, 2, 3, 4, 5], 1));

//9. Створити функцію, яка приймає один масив у якості аргументу та повертає булеве значення в залежності чи в неї
// передали пустий масив чи ні;
function isEmptyArr(arr) {
    if (arr[0] === undefined) {
        return true;
    } else return false;
}

// 10.Створити функцію, яка приймає один об’єкт у якості аргументу та повертає булеве значення в залежності чи в неї
// передали пустий об’єкт чи ні;
function isEmptyObj(obj) {
    for (let item in obj) {
        return false
    }
    return true;
}

// 11. Створити функцію, яка обєднає два масиви в один та поверне його в якості результату;
function concatArr(arr1, arr2) {
    return arr1.concat(arr2);
}

// 12. Створити функцію, яка приймає один масив чисел у якості аргументу та повертає новий масив, який складається з
// елементів попереднього в степені 3.
function doCubeArr(arr) {
    const cubeArr = arr.map(el => el * el * el);
    return cubeArr;
}

// 13. Створити функцію, яка приймає один масив чисел у якості аргументу та повертає новий масив, який складається з
// непарних елементів вхідного масиву;
function doOddArr(arr) {
    return arr.filter(el => el % 2);
}

// 14. Створити функцію, яка приймає один масив чисел у якості аргументу та повертає новий масив, який складається
// тільки з цілих елементів вхідного масиву; Для прикладу: [5, 3.14, 4.1, 10, 11, 20.1] ⇒ [5, 10, 11];

function doIntegersArr(arr){
    return arr.filter(el => (el ^ 0) === el);
}
// 15.Створити функцію, яка нічого не повертає;

function emptyFunc(){

}
